"""
1 : 1 , 1 , 2^0 , 1
2 : 2 , 11 / 2 , 2^1 , 1+1
3 : 4 , 111 / 12 21 / 3 , 2^2 , 1+2+1
4 : 7 , 1111 / 112 121 211 / 22 / 31 13 , 2^3 - 1, 1+3+1+2
5 : 13 , 11111 / 1112 1121 1211 2111 / 113 131 311 / 122 212 221 / 23 32 , 2^4 - 3 , 1+4+3+3+2
6 : 24 , 111111 / 11112 / 1113 / 222 / 33 / 1122 / 123, 2^5 - 8 = > 24 , - 114 141 411 42 24 15 51 6 ,  1+5+4+1+1+6+6
7 : 44 , 2^6 - n => 64 - n => n : 20

10 : 274

1 2 3 6 11 20
 1 1 3 5 9



A(1) = 1
A(2) = 2
A(3) = 4


[N=4 일 때]
1 + 3을. 표현 할 수 있는 경우의 수 [=A(3)]
2 + 2를 표현 할 수 있는 경우의 수 [=A(2)]
3 + 1을 표현 할 수 있는 경우의 수 [=A(1)]

즉 A(4) = A(3) + A(2) + A(1) = 4 + 2 + 1 = 7입니다.

https://jyami.tistory.com/15

"""

T = int(input())
n = []
answer = [1,2,4]
for _ in range(T):
    n.append(int(input()))

for a in range(3, max(n)):
    answer.append(answer[a-1] + answer[a-2] + answer[a-3])

for a in n :
    print(answer[a-1])
